In [1]:
a=10
b=20
c=a+b
c

30

In [ ]:
==================== EDA =======================================
1)Pandas : used for data frame applications

2)Numpy  : Numerical python All math applications

3)Matplotlib : used for plotting 

4)Seaborn : used for plotting

5)plotly : used for plot

6)Bokhe : used for plot


============================= Machine Learning ======================
7)Sickit-learn :sklearn  (important package)

============================== Deep learning ========================
8)Tensorflow  : developed by google

9)Keras   :    developed by google 

10)Pytorch  : developed by facebook

=============================== NLP  ================================

11) NLTK   : Natiral language tool kit

12)Scipy   : it is used by developer

================================ BERT ================================
13)Transformers : Hugging face(Google)

================================ Google models =======================
14)Specific google packages

================================Azure ML ============================
15)Azure packages

================================GenAI================================
16)GeminiAi  : Google
17)chatGPT  : OenAI

================================LangChain============================
18) LangChain packages

***Create a dataframe using list***

In [ ]:
- list === dictionary

- dictionary === list

$ Step-1 $
***create a empty dataframe***

In [2]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame()   #empty data frame will be created no rows and columns

Empty DataFrame
Columns: []
Index: []

$step-2$

***provide the data***

In [3]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [5]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
pd.DataFrame(zip(names,age))
# what is the first positional argument :data
#second positional argument:index

         0   1
0    Ayush  20
1  Avinash  30
2    Akash  40

In [7]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
sport=["cricket","hockey","chess"]
pd.DataFrame(zip(names,age,sport))

         0   1        2
0    Ayush  20  cricket
1  Avinash  30   hockey
2    Akash  40    chess

In [9]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
pd.DataFrame(zip(names,age,city))

         0   1        2
0    Ayush  20      hyd
1  Avinash  30      blr
2    Akash  40  chennai

In [10]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        Ayush  20
blr      Avinash  30
chennai    Akash  40

$step-3$

***provide the column names***

In [14]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
pd.DataFrame(zip(names,age),columns=["Names","Age"])

     Names  Age
0    Ayush   20
1  Avinash   30
2    Akash   40

In [16]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
pd.DataFrame(zip(names,age),["names","age","c"])        # the place of this is columns

             0   1
names    Ayush  20
age    Avinash  30
c        Akash  40

In [17]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
pd.DataFrame(zip(names,age,city),columns=["names","age","city"])

     names  age     city
0    Ayush   20      hyd
1  Avinash   30      blr
2    Akash   40  chennai

In [18]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age,city)
cols=["names","age","city"]
pd.DataFrame(data,columns=cols)

     names  age     city
0    Ayush   20      hyd
1  Avinash   30      blr
2    Akash   40  chennai

In [19]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age,city)
cols=["names","age","city"]
df=pd.DataFrame(data,columns=cols)

In [20]:
type(df)

pandas.core.frame.DataFrame

$step-4$

***Add new column***

- If you want to add new column
- First you need to check the number of rows in already existed data
- For example in above the dataframe has 3 rows
- you need to create a new list with 3 rows
- that list equate to the dataframe

In [22]:
job=["DS","DE","CS"]
df["JOB"]=job
df

     names  age     city JOB
0    Ayush   20      hyd  DS
1  Avinash   30      blr  DE
2    Akash   40  chennai  CS

In [23]:
sport=["chess","cricket","carrom"]
df["SPORT"]=sport
df

     names  age     city JOB    SPORT
0    Ayush   20      hyd  DS    chess
1  Avinash   30      blr  DE  cricket
2    Akash   40  chennai  CS   carrom

$step-5$

***Update the alraedy existed column***

- create new column and update new column in same way

In [26]:
sport=["cricket","badminton","hockey"]    #changing the values of already existed code
df["SPORT"]=sport
df

     names  age     city JOB      SPORT
0    Ayush   20      hyd  DS    cricket
1  Avinash   30      blr  DE  badminton
2    Akash   40  chennai  CS     hockey

$step-6$

***change the index***

In [27]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age,city)
cols=["names","age","city"]
idx=["a","b","c"]
df=pd.DataFrame(data,index=idx,columns=cols)
df

     names  age     city
a    Ayush   20      hyd
b  Avinash   30      blr
c    Akash   40  chennai

In [28]:
names=['Ayush','Avinash','Akash','Anvi']
age=[20,30,40,45]
city=["hyd","blr","chennai","mumbai"]
data=zip(names,age,city)
cols=["names","age","city"]
idx=["a","b","c","d"]
df=pd.DataFrame(data,index=idx,columns=cols)
df

     names  age     city
a    Ayush   20      hyd
b  Avinash   30      blr
c    Akash   40  chennai
d     Anvi   45   mumbai

***Note***
- Number of list equals to **number of columns**
- Number of values inside list equals to **number of rows**
- when you create the data all the lists will be in same length

$step-7$

***shape***

- Number of rows
- Number of columns

In [31]:
df.shape   #matrix format
# 4 rows and 3 columns
print("The number of rows are:",df.shape[0])
print("The number of columns are:",df.shape[1])

The number of rows are: 4
The number of columns are: 3

$step-8$

***Drop the column***

- In order to drop the column we require 3 arguments
- Column name
   - The column name we need to mention
- axis
   - axis=0 means **rows** (we are dropping the rows)
   - axis=1 **represents columns**
- inplace
    - we are drop column means we are modifying the data frame
    - so this modification we want to save in same variable or different variable
    - if you want to keep in the same variable the **inplace=True**

In [32]:
df

     names  age     city
a    Ayush   20      hyd
b  Avinash   30      blr
c    Akash   40  chennai
d     Anvi   45   mumbai

In [37]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age,city)
cols=["names","age","city"]
idx=["a","b","c"]
df=pd.DataFrame(data,index=idx,columns=cols)
df.drop("city",axis=1,inplace=True)
df

     names  age
a    Ayush   20
b  Avinash   30
c    Akash   40

In [52]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age,city)
cols=["names","age","city"]
idx=["a","b","c"]
df=pd.DataFrame(data,index=idx,columns=cols)
df.drop("city",axis=1,inplace=True)
df

     names  age
a    Ayush   20
b  Avinash   30
c    Akash   40

In [53]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age,city)
cols=["names","age","city"]
idx=["a","b","c"]
df=pd.DataFrame(data,index=idx,columns=cols)
df.drop("age",axis=1,inplace=True)
df

     names     city
a    Ayush      hyd
b  Avinash      blr
c    Akash  chennai

In [54]:
df1=df.drop("city",axis=1)

In [55]:
df1

     names
a    Ayush
b  Avinash
c    Akash

$step-9$

***multiple columns***

In [57]:
names=['Ayush','Avinash','Akash','Anvi']
age=[20,30,40,45]
city=["hyd","blr","chennai","mumbai"]
data=zip(names,age,city)
cols=["names","age","city"]
idx=["a","b","c","d"]
df=pd.DataFrame(data,index=idx,columns=cols)
df.drop(["age","city"],axis=1,inplace=True)   #deleting two columns
df

     names
a    Ayush
b  Avinash
c    Akash
d     Anvi

$step-10$

***drop the rows***

In [59]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age,city)
cols=["names","age","city"]
idx=["a","b","c"]
df=pd.DataFrame(data,index=idx,columns=cols)
df.drop("a",axis=0,inplace=True)
df

     names  age     city
b  Avinash   30      blr
c    Akash   40  chennai

In [60]:
df.drop("b",axis=0)
df

     names  age     city
b  Avinash   30      blr
c    Akash   40  chennai

In [61]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
city=["hyd","blr","chennai"]
data=zip(names,age,city)
cols=["names","age","city"]
idx=["a","b","c"]
df=pd.DataFrame(data,index=idx,columns=cols)
df.drop(["b","c"],axis=0,inplace=True)
df

   names  age city
a  Ayush   20  hyd

$step-11$

***How to save the dataframe***
- Generally data frames are two types
- csv(comma seperated value)
- excel

In [63]:
#file name=data
#extension=.csv
df.to_csv("data.csv")
df.to_csv("data1.csv",index=False)

In [69]:
#Extension for excel is .xlsx
df.to_excel("data2.xlsx")
df.to_excel("data3.xlsx",index=False)